Процедура ОсновнаяПрограмма() Экспорт

    Сотрудники = Новый Массив;

    // добавление тестовых данных
    Сотрудники.Добавить(СоздатьРаботника("Иванов И.И.", "Программист 1С", 2000, 2020));
    Сотрудники.Добавить(СоздатьРаботника("Петров П.П.", "Аналитик", 1800, 2018));
    Сотрудники.Добавить(СоздатьРаботника("Сидоров С.С.", "Тестировщик", 1500, 2023));

    ВводСтажа = 3;

    Найдены = Ложь;

    Для каждого Сотрудник Из Сотрудники Цикл

        Стаж = Год(ТекущаяДата()) - Сотрудник.ГодПриема;

        Если Стаж > ВводСтажа Тогда
            Сообщить(Сотрудник.ФИО);
            Найдены = Истина;
        КонецЕсли;

    КонецЦикла;

    Если НЕ Найдены Тогда
        Сообщить("Сотрудники с указанным стажем не найдены");
    КонецЕсли;

КонецПроцедуры
